
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	
	ДоступностьКоманд = ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ)
		И СистемаВзаимодействия.ИспользованиеДоступно();
		
	Если ДоступностьКоманд Тогда
		
		ИдентификаторПользователя = ПолучитьИдентификаторПользователя(Объект.ИдентификаторПользователяИБ);
		ДоступностьКоманд = ИдентификаторПользователя <> Неопределено;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторПользователя(ИдентификаторПользователяИБ)
	#Если Не (МобильноеПриложениеСервер Или МобильныйАвтономныйСервер Или ВнешнееСоединение) Тогда
	Попытка
		Возврат СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторПользователяИБ);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	#Иначе
	Возврат Неопределено;
	#КонецЕсли
КонецФункции

#КонецОбласти