
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьПроцентовСкидки();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидБонуснойПрограммыПриИзменении(Элемент)
	
	УстановитьДоступностьПроцентовСкидки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьПроцентовСкидки()

	Если Объект.ВидБонуснойПрограммы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхПрограмм.Скидочная") Тогда
		Элементы.ПроцентСкидки.Доступность = Истина;
		Элементы.ПроцентНачисляемыхБаллов.Доступность = Ложь;
	ИначеЕсли Объект.ВидБонуснойПрограммы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхПрограмм.Накопительная") Тогда
		Элементы.ПроцентСкидки.Доступность = Ложь;
		Элементы.ПроцентНачисляемыхБаллов.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти