


&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	RabbitMQОбъект = РеквизитФормыВЗначение("Объект"); 
	RabbitMQОбъект.ПодключитьКомпоненту(); 
	
	ПараметрыОбмена = Новый Структура("ТочкаОбмена, ИмяОчереди, КлючМаршрутизации, ТекстСообщения");
	ПараметрыОбмена.ТочкаОбмена			= "goods";
	ПараметрыОбмена.ИмяОчереди			= "WMS";
    ПараметрыОбмена.КлючМаршрутизации	= "#WMS#";
	ПараметрыОбмена.ТекстСообщения		= "Текст1";

	RabbitMQОбъект.ОтправитьСообщение(ПараметрыОбмена);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСообщение(Команда)
	ПрочитатьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСообщениеНаСервере()
	
	RabbitMQОбъект = РеквизитФормыВЗначение("Объект"); 
	RabbitMQОбъект.ПодключитьКомпоненту(); 
	
	ПараметрыОбмена = Новый Структура("ИмяОчереди, ОтветноеСообщение");
	ПараметрыОбмена.ИмяОчереди			= "WMS";

	RabbitMQОбъект.ПрочитатьСообщения(ПараметрыОбмена);
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	RabbitMQОбъект = РеквизитФормыВЗначение("Объект"); 
	RabbitMQОбъект.ПодключитьКомпоненту();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеТочкиИОчереди(Команда)
	СозданиеТочкиИОчередиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеТочкиИОчередиНаСервере()
	RabbitMQОбъект = РеквизитФормыВЗначение("Объект"); 
	RabbitMQОбъект.ПодключитьКомпоненту();
	ПараметрыОбмена = Новый Структура("ИмяОчереди, ТочкаОбмена");
	ПараметрыОбмена.ТочкаОбмена			= "goods";
	ПараметрыОбмена.ИмяОчереди			= "WMS";

	RabbitMQОбъект.СозданиеТочкиИОчереди(ПараметрыОбмена);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРЗ(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()
	ИнтеграцияRabbitMQ.ОтправитьСообщениеВRabbitMQ();
КонецПроцедуры
